ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/EL32_Slave2/Project_Headers/mc9s08el32.h
/*** SLCC2 - SLIC Control Register 2; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte SLCE        :1;                                       /* SLIC Module Enable */
    byte             :1; 
    byte BTM         :1;                                       /* UART Byte Transfer Mode */
    byte SLCWCM      :1;                                       /* SLIC Wait Clock Mode */
    byte RXFP0       :1;                                       /* Receive Filter Prescaler Bit0 */
    byte RXFP1       :1;                                       /* Receive Filter Prescaler Bit1 */
    byte RXFP2       :1;                                       /* Receive Filter Prescaler Bit2 */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpRXFP :3;
    byte         :1;
  } MergedBits;
} SLCC2STR;
extern volatile SLCC2STR _SLCC2 @0x00000071;
#define SLCC2                           _SLCC2.Byte
#define SLCC2_SLCE                      _SLCC2.Bits.SLCE
#define SLCC2_BTM                       _SLCC2.Bits.BTM
#define SLCC2_SLCWCM                    _SLCC2.Bits.SLCWCM
#define SLCC2_RXFP0                     _SLCC2.Bits.RXFP0
#define SLCC2_RXFP1                     _SLCC2.Bits.RXFP1
#define SLCC2_RXFP2                     _SLCC2.Bits.RXFP2
#define SLCC2_RXFP                      _SLCC2.MergedBits.grpRXFP

#define SLCC2_SLCE_MASK                 1U
#define SLCC2_BTM_MASK                  4U
#define SLCC2_SLCWCM_MASK               8U
#define SLCC2_RXFP0_MASK                16U
#define SLCC2_RXFP1_MASK                32U
#define SLCC2_RXFP2_MASK                64U
#define SLCC2_RXFP_MASK                 112U
#define SLCC2_RXFP_BITNUM               4U


/*** SLCBT - SLIC Bit Time Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SLCBTH - SLIC Bit Time Register High; 0x00000072 ***/
    union {
      byte Byte;
      struct {
        byte BT8         :1;                                       /* Bit Time Value Bit 8 */
        byte BT9         :1;                                       /* Bit Time Value Bit 9 */
        byte BT10        :1;                                       /* Bit Time Value Bit 10 */
        byte BT11        :1;                                       /* Bit Time Value Bit 11 */
        byte BT12        :1;                                       /* Bit Time Value Bit 12 */
        byte BT13        :1;                                       /* Bit Time Value Bit 13 */
        byte BT14        :1;                                       /* Bit Time Value Bit 14 */
        byte             :1; 
      } Bits;
      struct {
        byte grpBT_8 :7;
        byte     :1;
      } MergedBits;
    } SLCBTHSTR;
    #define SLCBTH                      _SLCBT.Overlap_STR.SLCBTHSTR.Byte
    #define SLCBTH_BT8                  _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT8
    #define SLCBTH_BT9                  _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT9
    #define SLCBTH_BT10                 _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT10
    #define SLCBTH_BT11                 _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT11
    #define SLCBTH_BT12                 _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT12
    #define SLCBTH_BT13                 _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT13
    #define SLCBTH_BT14                 _SLCBT.Overlap_STR.SLCBTHSTR.Bits.BT14
    #define SLCBTH_BT_8                 _SLCBT.Overlap_STR.SLCBTHSTR.MergedBits.grpBT_8
    #define SLCBTH_BT                   SLCBTH_BT_8
    
    #define SLCBTH_BT8_MASK             1U
    #define SLCBTH_BT9_MASK             2U
    #define SLCBTH_BT10_MASK            4U
    #define SLCBTH_BT11_MASK            8U
    #define SLCBTH_BT12_MASK            16U
    #define SLCBTH_BT13_MASK            32U
    #define SLCBTH_BT14_MASK            64U
    #define SLCBTH_BT_8_MASK            127U
    #define SLCBTH_BT_8_BITNUM          0U
    

    /*** SLCBTL - SLIC Bit Time Register Low; 0x00000073 ***/
    union {
      byte Byte;
      struct {
        byte BT0         :1;                                       /* Bit Time Value Bit 0 */
        byte BT1         :1;                                       /* Bit Time Value Bit 1 */
        byte BT2         :1;                                       /* Bit Time Value Bit 2 */
        byte BT3         :1;                                       /* Bit Time Value Bit 3 */
        byte BT4         :1;                                       /* Bit Time Value Bit 4 */
        byte BT5         :1;                                       /* Bit Time Value Bit 5 */
        byte BT6         :1;                                       /* Bit Time Value Bit 6 */
        byte BT7         :1;                                       /* Bit Time Value Bit 7 */
      } Bits;
    } SLCBTLSTR;
    #define SLCBTL                      _SLCBT.Overlap_STR.SLCBTLSTR.Byte
    #define SLCBTL_BT0                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT0
    #define SLCBTL_BT1                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT1
    #define SLCBTL_BT2                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT2
    #define SLCBTL_BT3                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT3
    #define SLCBTL_BT4                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT4
    #define SLCBTL_BT5                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT5
    #define SLCBTL_BT6                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT6
    #define SLCBTL_BT7                  _SLCBT.Overlap_STR.SLCBTLSTR.Bits.BT7
    
    #define SLCBTL_BT0_MASK             1U
    #define SLCBTL_BT1_MASK             2U
    #define SLCBTL_BT2_MASK             4U
    #define SLCBTL_BT3_MASK             8U
    #define SLCBTL_BT4_MASK             16U
    #define SLCBTL_BT5_MASK             32U
    #define SLCBTL_BT6_MASK             64U
    #define SLCBTL_BT7_MASK             128U
    
  } Overlap_STR;

} SLCBTSTR;
extern volatile SLCBTSTR _SLCBT @0x00000072;
#define SLCBT                           _SLCBT.Word


/*** SLCS - SLIC Status Register; 0x00000074 ***/
typedef union {
  byte Byte;
  struct {
    byte SLCF        :1;                                       /* SLIC Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte INITACK     :1;                                       /* Initialization Mode Acknowledge */
    byte             :1; 
    byte SLCACT      :1;                                       /* SLIC Active (Oscillator Trim Blocking Semaphore) */
  } Bits;
} SLCSSTR;
extern volatile SLCSSTR _SLCS @0x00000074;
#define SLCS                            _SLCS.Byte
#define SLCS_SLCF                       _SLCS.Bits.SLCF
#define SLCS_INITACK                    _SLCS.Bits.INITACK
#define SLCS_SLCACT                     _SLCS.Bits.SLCACT

