ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/EL32_Slave2/Project_Headers/mc9s08el32.h
#define SLCS_SLCF_MASK                  1U
#define SLCS_INITACK_MASK               32U
#define SLCS_SLCACT_MASK                128U


/*** SLCSV - SLIC State Vector Register; 0x00000075 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte I0          :1;                                       /* Interrupt State Vector Bit 0 */
    byte I1          :1;                                       /* Interrupt State Vector Bit 1 */
    byte I2          :1;                                       /* Interrupt State Vector Bit 2 */
    byte I3          :1;                                       /* Interrupt State Vector Bit 3 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpI    :4;
    byte         :1;
    byte         :1;
  } MergedBits;
} SLCSVSTR;
extern volatile SLCSVSTR _SLCSV @0x00000075;
#define SLCSV                           _SLCSV.Byte
#define SLCSV_I0                        _SLCSV.Bits.I0
#define SLCSV_I1                        _SLCSV.Bits.I1
#define SLCSV_I2                        _SLCSV.Bits.I2
#define SLCSV_I3                        _SLCSV.Bits.I3
#define SLCSV_I                         _SLCSV.MergedBits.grpI

#define SLCSV_I0_MASK                   4U
#define SLCSV_I1_MASK                   8U
#define SLCSV_I2_MASK                   16U
#define SLCSV_I3_MASK                   32U
#define SLCSV_I_MASK                    60U
#define SLCSV_I_BITNUM                  2U


/*** SLCDLC - SLIC Data Length Code Register; 0x00000076 ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Control Bit 0 */
    byte DLC1        :1;                                       /* Data Length Control Bit 1 */
    byte DLC2        :1;                                       /* Data Length Control Bit 2 */
    byte DLC3        :1;                                       /* Data Length Control Bit 3 */
    byte DLC4        :1;                                       /* Data Length Control Bit 4 */
    byte DLC5        :1;                                       /* Data Length Control Bit 5 */
    byte CHKMOD      :1;                                       /* LIN Checksum Mode */
    byte TXGO        :1;                                       /* SLIC Transmit Go */
  } Bits;
  struct {
    byte grpDLC  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} SLCDLCSTR;
extern volatile SLCDLCSTR _SLCDLC @0x00000076;
#define SLCDLC                          _SLCDLC.Byte
#define SLCDLC_DLC0                     _SLCDLC.Bits.DLC0
#define SLCDLC_DLC1                     _SLCDLC.Bits.DLC1
#define SLCDLC_DLC2                     _SLCDLC.Bits.DLC2
#define SLCDLC_DLC3                     _SLCDLC.Bits.DLC3
#define SLCDLC_DLC4                     _SLCDLC.Bits.DLC4
#define SLCDLC_DLC5                     _SLCDLC.Bits.DLC5
#define SLCDLC_CHKMOD                   _SLCDLC.Bits.CHKMOD
#define SLCDLC_TXGO                     _SLCDLC.Bits.TXGO
#define SLCDLC_DLC                      _SLCDLC.MergedBits.grpDLC

#define SLCDLC_DLC0_MASK                1U
#define SLCDLC_DLC1_MASK                2U
#define SLCDLC_DLC2_MASK                4U
#define SLCDLC_DLC3_MASK                8U
#define SLCDLC_DLC4_MASK                16U
#define SLCDLC_DLC5_MASK                32U
#define SLCDLC_CHKMOD_MASK              64U
#define SLCDLC_TXGO_MASK                128U
#define SLCDLC_DLC_MASK                 63U
#define SLCDLC_DLC_BITNUM               0U


/*** SLCID - SLIC Identifier Register; 0x00000077 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCIDSTR;
extern volatile SLCIDSTR _SLCID @0x00000077;
#define SLCID                           _SLCID.Byte
#define SLCID_R0_T0                     _SLCID.Bits.R0_T0
#define SLCID_R1_T1                     _SLCID.Bits.R1_T1
#define SLCID_R2_T2                     _SLCID.Bits.R2_T2
#define SLCID_R3_T3                     _SLCID.Bits.R3_T3
#define SLCID_R4_T4                     _SLCID.Bits.R4_T4
#define SLCID_R5_T5                     _SLCID.Bits.R5_T5
#define SLCID_R6_T6                     _SLCID.Bits.R6_T6
#define SLCID_R7_T7                     _SLCID.Bits.R7_T7

#define SLCID_R0_T0_MASK                1U
#define SLCID_R1_T1_MASK                2U
#define SLCID_R2_T2_MASK                4U
#define SLCID_R3_T3_MASK                8U
#define SLCID_R4_T4_MASK                16U
#define SLCID_R5_T5_MASK                32U
#define SLCID_R6_T6_MASK                64U
#define SLCID_R7_T7_MASK                128U


/*** SLCD0 - SLIC Data Register 0; 0x00000078 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD0STR;
extern volatile SLCD0STR _SLCD0 @0x00000078;
#define SLCD0                           _SLCD0.Byte
#define SLCD0_R0_T0                     _SLCD0.Bits.R0_T0
#define SLCD0_R1_T1                     _SLCD0.Bits.R1_T1
#define SLCD0_R2_T2                     _SLCD0.Bits.R2_T2
#define SLCD0_R3_T3                     _SLCD0.Bits.R3_T3
#define SLCD0_R4_T4                     _SLCD0.Bits.R4_T4
#define SLCD0_R5_T5                     _SLCD0.Bits.R5_T5
#define SLCD0_R6_T6                     _SLCD0.Bits.R6_T6
#define SLCD0_R7_T7                     _SLCD0.Bits.R7_T7
/* SLCD_ARR: Access 8 SLCDx registers in an array */
#define SLCD_ARR                        ((volatile byte * __far) &SLCD0)

