ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/EL32_Slave2/Project_Headers/mc9s08el32.h
#define SLCD0_R0_T0_MASK                1U
#define SLCD0_R1_T1_MASK                2U
#define SLCD0_R2_T2_MASK                4U
#define SLCD0_R3_T3_MASK                8U
#define SLCD0_R4_T4_MASK                16U
#define SLCD0_R5_T5_MASK                32U
#define SLCD0_R6_T6_MASK                64U
#define SLCD0_R7_T7_MASK                128U


/*** SLCD1 - SLIC Data Register 1; 0x00000079 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD1STR;
extern volatile SLCD1STR _SLCD1 @0x00000079;
#define SLCD1                           _SLCD1.Byte
#define SLCD1_R0_T0                     _SLCD1.Bits.R0_T0
#define SLCD1_R1_T1                     _SLCD1.Bits.R1_T1
#define SLCD1_R2_T2                     _SLCD1.Bits.R2_T2
#define SLCD1_R3_T3                     _SLCD1.Bits.R3_T3
#define SLCD1_R4_T4                     _SLCD1.Bits.R4_T4
#define SLCD1_R5_T5                     _SLCD1.Bits.R5_T5
#define SLCD1_R6_T6                     _SLCD1.Bits.R6_T6
#define SLCD1_R7_T7                     _SLCD1.Bits.R7_T7

#define SLCD1_R0_T0_MASK                1U
#define SLCD1_R1_T1_MASK                2U
#define SLCD1_R2_T2_MASK                4U
#define SLCD1_R3_T3_MASK                8U
#define SLCD1_R4_T4_MASK                16U
#define SLCD1_R5_T5_MASK                32U
#define SLCD1_R6_T6_MASK                64U
#define SLCD1_R7_T7_MASK                128U


/*** SLCD2 - SLIC Data Register 2; 0x0000007A ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD2STR;
extern volatile SLCD2STR _SLCD2 @0x0000007A;
#define SLCD2                           _SLCD2.Byte
#define SLCD2_R0_T0                     _SLCD2.Bits.R0_T0
#define SLCD2_R1_T1                     _SLCD2.Bits.R1_T1
#define SLCD2_R2_T2                     _SLCD2.Bits.R2_T2
#define SLCD2_R3_T3                     _SLCD2.Bits.R3_T3
#define SLCD2_R4_T4                     _SLCD2.Bits.R4_T4
#define SLCD2_R5_T5                     _SLCD2.Bits.R5_T5
#define SLCD2_R6_T6                     _SLCD2.Bits.R6_T6
#define SLCD2_R7_T7                     _SLCD2.Bits.R7_T7

#define SLCD2_R0_T0_MASK                1U
#define SLCD2_R1_T1_MASK                2U
#define SLCD2_R2_T2_MASK                4U
#define SLCD2_R3_T3_MASK                8U
#define SLCD2_R4_T4_MASK                16U
#define SLCD2_R5_T5_MASK                32U
#define SLCD2_R6_T6_MASK                64U
#define SLCD2_R7_T7_MASK                128U


/*** SLCD3 - SLIC Data Register 3; 0x0000007B ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD3STR;
extern volatile SLCD3STR _SLCD3 @0x0000007B;
#define SLCD3                           _SLCD3.Byte
#define SLCD3_R0_T0                     _SLCD3.Bits.R0_T0
#define SLCD3_R1_T1                     _SLCD3.Bits.R1_T1
#define SLCD3_R2_T2                     _SLCD3.Bits.R2_T2
#define SLCD3_R3_T3                     _SLCD3.Bits.R3_T3
#define SLCD3_R4_T4                     _SLCD3.Bits.R4_T4
#define SLCD3_R5_T5                     _SLCD3.Bits.R5_T5
#define SLCD3_R6_T6                     _SLCD3.Bits.R6_T6
#define SLCD3_R7_T7                     _SLCD3.Bits.R7_T7

#define SLCD3_R0_T0_MASK                1U
#define SLCD3_R1_T1_MASK                2U
#define SLCD3_R2_T2_MASK                4U
#define SLCD3_R3_T3_MASK                8U
#define SLCD3_R4_T4_MASK                16U
#define SLCD3_R5_T5_MASK                32U
#define SLCD3_R6_T6_MASK                64U
#define SLCD3_R7_T7_MASK                128U


/*** SLCD4 - SLIC Data Register 4; 0x0000007C ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD4STR;
extern volatile SLCD4STR _SLCD4 @0x0000007C;
#define SLCD4                           _SLCD4.Byte
#define SLCD4_R0_T0                     _SLCD4.Bits.R0_T0
#define SLCD4_R1_T1                     _SLCD4.Bits.R1_T1
#define SLCD4_R2_T2                     _SLCD4.Bits.R2_T2
#define SLCD4_R3_T3                     _SLCD4.Bits.R3_T3
#define SLCD4_R4_T4                     _SLCD4.Bits.R4_T4
#define SLCD4_R5_T5                     _SLCD4.Bits.R5_T5
#define SLCD4_R6_T6                     _SLCD4.Bits.R6_T6
#define SLCD4_R7_T7                     _SLCD4.Bits.R7_T7

