ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/EL32_Slave2/Project_Headers/mc9s08el32.h
#define SLCD4_R0_T0_MASK                1U
#define SLCD4_R1_T1_MASK                2U
#define SLCD4_R2_T2_MASK                4U
#define SLCD4_R3_T3_MASK                8U
#define SLCD4_R4_T4_MASK                16U
#define SLCD4_R5_T5_MASK                32U
#define SLCD4_R6_T6_MASK                64U
#define SLCD4_R7_T7_MASK                128U


/*** SLCD5 - SLIC Data Register 5; 0x0000007D ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD5STR;
extern volatile SLCD5STR _SLCD5 @0x0000007D;
#define SLCD5                           _SLCD5.Byte
#define SLCD5_R0_T0                     _SLCD5.Bits.R0_T0
#define SLCD5_R1_T1                     _SLCD5.Bits.R1_T1
#define SLCD5_R2_T2                     _SLCD5.Bits.R2_T2
#define SLCD5_R3_T3                     _SLCD5.Bits.R3_T3
#define SLCD5_R4_T4                     _SLCD5.Bits.R4_T4
#define SLCD5_R5_T5                     _SLCD5.Bits.R5_T5
#define SLCD5_R6_T6                     _SLCD5.Bits.R6_T6
#define SLCD5_R7_T7                     _SLCD5.Bits.R7_T7

#define SLCD5_R0_T0_MASK                1U
#define SLCD5_R1_T1_MASK                2U
#define SLCD5_R2_T2_MASK                4U
#define SLCD5_R3_T3_MASK                8U
#define SLCD5_R4_T4_MASK                16U
#define SLCD5_R5_T5_MASK                32U
#define SLCD5_R6_T6_MASK                64U
#define SLCD5_R7_T7_MASK                128U


/*** SLCD6 - SLIC Data Register 6; 0x0000007E ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD6STR;
extern volatile SLCD6STR _SLCD6 @0x0000007E;
#define SLCD6                           _SLCD6.Byte
#define SLCD6_R0_T0                     _SLCD6.Bits.R0_T0
#define SLCD6_R1_T1                     _SLCD6.Bits.R1_T1
#define SLCD6_R2_T2                     _SLCD6.Bits.R2_T2
#define SLCD6_R3_T3                     _SLCD6.Bits.R3_T3
#define SLCD6_R4_T4                     _SLCD6.Bits.R4_T4
#define SLCD6_R5_T5                     _SLCD6.Bits.R5_T5
#define SLCD6_R6_T6                     _SLCD6.Bits.R6_T6
#define SLCD6_R7_T7                     _SLCD6.Bits.R7_T7

#define SLCD6_R0_T0_MASK                1U
#define SLCD6_R1_T1_MASK                2U
#define SLCD6_R2_T2_MASK                4U
#define SLCD6_R3_T3_MASK                8U
#define SLCD6_R4_T4_MASK                16U
#define SLCD6_R5_T5_MASK                32U
#define SLCD6_R6_T6_MASK                64U
#define SLCD6_R7_T7_MASK                128U


/*** SLCD7 - SLIC Data Register 7; 0x0000007F ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SLCD7STR;
extern volatile SLCD7STR _SLCD7 @0x0000007F;
#define SLCD7                           _SLCD7.Byte
#define SLCD7_R0_T0                     _SLCD7.Bits.R0_T0
#define SLCD7_R1_T1                     _SLCD7.Bits.R1_T1
#define SLCD7_R2_T2                     _SLCD7.Bits.R2_T2
#define SLCD7_R3_T3                     _SLCD7.Bits.R3_T3
#define SLCD7_R4_T4                     _SLCD7.Bits.R4_T4
#define SLCD7_R5_T5                     _SLCD7.Bits.R5_T5
#define SLCD7_R6_T6                     _SLCD7.Bits.R6_T6
#define SLCD7_R7_T7                     _SLCD7.Bits.R7_T7

#define SLCD7_R0_T0_MASK                1U
#define SLCD7_R1_T1_MASK                2U
#define SLCD7_R2_T2_MASK                4U
#define SLCD7_R3_T3_MASK                8U
#define SLCD7_R4_T4_MASK                16U
#define SLCD7_R5_T5_MASK                32U
#define SLCD7_R6_T6_MASK                64U
#define SLCD7_R7_T7_MASK                128U


/*** SRS - System Reset Status Register; 0x00001800 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte LVD         :1;                                       /* Low Voltage Detect */
    byte             :1; 
    byte ILAD        :1;                                       /* Illegal Address */
    byte ILOP        :1;                                       /* Illegal Opcode */
    byte COP         :1;                                       /* Computer Operating Properly (COP) Watchdog */
    byte PIN         :1;                                       /* External Reset Pin */
    byte POR         :1;                                       /* Power-On Reset */
  } Bits;
} SRSSTR;
