ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/EL32_Slave2/Project_Headers/mc9s08el32.h
/*** PTCSC - Port C Interrupt Status and Control Register; 0x00001854 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCMOD      :1;                                       /* Port C Detection Mode */
    byte PTCIE       :1;                                       /* Port C Interrupt Enable */
    byte PTCACK      :1;                                       /* Port C Interrupt Acknowledge */
    byte PTCIF       :1;                                       /* Port C Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTCSCSTR;
extern volatile PTCSCSTR _PTCSC @0x00001854;
#define PTCSC                           _PTCSC.Byte
#define PTCSC_PTCMOD                    _PTCSC.Bits.PTCMOD
#define PTCSC_PTCIE                     _PTCSC.Bits.PTCIE
#define PTCSC_PTCACK                    _PTCSC.Bits.PTCACK
#define PTCSC_PTCIF                     _PTCSC.Bits.PTCIF

#define PTCSC_PTCMOD_MASK               1U
#define PTCSC_PTCIE_MASK                2U
#define PTCSC_PTCACK_MASK               4U
#define PTCSC_PTCIF_MASK                8U


/*** PTCPS - Port C Interrupt Pin Select Register; 0x00001855 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCPS0      :1;                                       /* Port C Interrupt Pin Select Bit 0 */
    byte PTCPS1      :1;                                       /* Port C Interrupt Pin Select Bit 1 */
    byte PTCPS2      :1;                                       /* Port C Interrupt Pin Select Bit 2 */
    byte PTCPS3      :1;                                       /* Port C Interrupt Pin Select Bit 3 */
    byte PTCPS4      :1;                                       /* Port C Interrupt Pin Select Bit 4 */
    byte PTCPS5      :1;                                       /* Port C Interrupt Pin Select Bit 5 */
    byte PTCPS6      :1;                                       /* Port C Interrupt Pin Select Bit 6 */
    byte PTCPS7      :1;                                       /* Port C Interrupt Pin Select Bit 7 */
  } Bits;
} PTCPSSTR;
extern volatile PTCPSSTR _PTCPS @0x00001855;
#define PTCPS                           _PTCPS.Byte
#define PTCPS_PTCPS0                    _PTCPS.Bits.PTCPS0
#define PTCPS_PTCPS1                    _PTCPS.Bits.PTCPS1
#define PTCPS_PTCPS2                    _PTCPS.Bits.PTCPS2
#define PTCPS_PTCPS3                    _PTCPS.Bits.PTCPS3
#define PTCPS_PTCPS4                    _PTCPS.Bits.PTCPS4
#define PTCPS_PTCPS5                    _PTCPS.Bits.PTCPS5
#define PTCPS_PTCPS6                    _PTCPS.Bits.PTCPS6
#define PTCPS_PTCPS7                    _PTCPS.Bits.PTCPS7

#define PTCPS_PTCPS0_MASK               1U
#define PTCPS_PTCPS1_MASK               2U
#define PTCPS_PTCPS2_MASK               4U
#define PTCPS_PTCPS3_MASK               8U
#define PTCPS_PTCPS4_MASK               16U
#define PTCPS_PTCPS5_MASK               32U
#define PTCPS_PTCPS6_MASK               64U
#define PTCPS_PTCPS7_MASK               128U


/*** PTCES - Port C Interrupt Edge Select Register; 0x00001856 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCES0      :1;                                       /* Port C Edge Select Bit 0 */
    byte PTCES1      :1;                                       /* Port C Edge Select Bit 1 */
    byte PTCES2      :1;                                       /* Port C Edge Select Bit 2 */
    byte PTCES3      :1;                                       /* Port C Edge Select Bit 3 */
    byte PTCES4      :1;                                       /* Port C Edge Select Bit 4 */
    byte PTCES5      :1;                                       /* Port C Edge Select Bit 5 */
    byte PTCES6      :1;                                       /* Port C Edge Select Bit 6 */
    byte PTCES7      :1;                                       /* Port C Edge Select Bit 7 */
  } Bits;
} PTCESSTR;
extern volatile PTCESSTR _PTCES @0x00001856;
#define PTCES                           _PTCES.Byte
#define PTCES_PTCES0                    _PTCES.Bits.PTCES0
#define PTCES_PTCES1                    _PTCES.Bits.PTCES1
#define PTCES_PTCES2                    _PTCES.Bits.PTCES2
#define PTCES_PTCES3                    _PTCES.Bits.PTCES3
#define PTCES_PTCES4                    _PTCES.Bits.PTCES4
#define PTCES_PTCES5                    _PTCES.Bits.PTCES5
#define PTCES_PTCES6                    _PTCES.Bits.PTCES6
#define PTCES_PTCES7                    _PTCES.Bits.PTCES7

#define PTCES_PTCES0_MASK               1U
#define PTCES_PTCES1_MASK               2U
#define PTCES_PTCES2_MASK               4U
#define PTCES_PTCES3_MASK               8U
#define PTCES_PTCES4_MASK               16U
#define PTCES_PTCES5_MASK               32U
#define PTCES_PTCES6_MASK               64U
#define PTCES_PTCES7_MASK               128U


/*** NVBACKKEY0 - Backdoor Comparison Key 0; 0x0000FFB0 ***/
typedef union {
  byte Byte;
  struct {
    byte KEY0        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 0 */
    byte KEY1        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 1 */
    byte KEY2        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 2 */
    byte KEY3        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 3 */
    byte KEY4        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 4 */
    byte KEY5        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 5 */
    byte KEY6        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 6 */
    byte KEY7        :1;                                       /* Backdoor Comparison Key 0 Bits, bit 7 */
  } Bits;
} NVBACKKEY0STR;
/* Tip for register initialization in the user code:  const byte NVBACKKEY0_INIT @0x0000FFB0 = <NVBACKKEY0_INITVAL>; */
#define _NVBACKKEY0 (*(const NVBACKKEY0STR * __far)0x0000FFB0)
#define NVBACKKEY0                      _NVBACKKEY0.Byte
#define NVBACKKEY0_KEY0                 _NVBACKKEY0.Bits.KEY0
#define NVBACKKEY0_KEY1                 _NVBACKKEY0.Bits.KEY1
#define NVBACKKEY0_KEY2                 _NVBACKKEY0.Bits.KEY2
#define NVBACKKEY0_KEY3                 _NVBACKKEY0.Bits.KEY3
#define NVBACKKEY0_KEY4                 _NVBACKKEY0.Bits.KEY4
#define NVBACKKEY0_KEY5                 _NVBACKKEY0.Bits.KEY5
#define NVBACKKEY0_KEY6                 _NVBACKKEY0.Bits.KEY6
#define NVBACKKEY0_KEY7                 _NVBACKKEY0.Bits.KEY7
/* NVBACKKEY_ARR: Access 8 NVBACKKEYx registers in an array */
#define NVBACKKEY_ARR                   ((volatile byte * __far) &NVBACKKEY0)

#define NVBACKKEY0_KEY0_MASK            1U
#define NVBACKKEY0_KEY1_MASK            2U
#define NVBACKKEY0_KEY2_MASK            4U
#define NVBACKKEY0_KEY3_MASK            8U
#define NVBACKKEY0_KEY4_MASK            16U
#define NVBACKKEY0_KEY5_MASK            32U
#define NVBACKKEY0_KEY6_MASK            64U
#define NVBACKKEY0_KEY7_MASK            128U


