ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/EL32_Slave2/Project_Headers/mc9s08el32.h
#define NVOPT_SEC0_MASK                 1U
#define NVOPT_SEC1_MASK                 2U
#define NVOPT_EPGMOD_MASK               32U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC_MASK                  3U
#define NVOPT_SEC_BITNUM                0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 26.7.2007 9:08:54 */

#define FTSTMOD                          This_symb_has_been_depreciated
#define FTSTMOD_MRDS0                    This_symb_has_been_depreciated
#define FTSTMOD_MRDS1                    This_symb_has_been_depreciated
#define FTSTMOD_MRDS                     This_symb_has_been_depreciated
#define FTSTMOD_MRDS0_MASK               This_symb_has_been_depreciated
#define FTSTMOD_MRDS1_MASK               This_symb_has_been_depreciated
#define FTSTMOD_MRDS_MASK                This_symb_has_been_depreciated
#define FTSTMOD_MRDS_BITNUM              This_symb_has_been_depreciated
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
